wanderful-travel-planner-backend/app/controllers/api/v1/auth_controller.rb

    def login
        @user = User.find_by(email: params[:auth][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "das"], ["LIMIT", 1]]